Revit 2027 API
RebarShapeTerminationsData.HasCrankAtEnd Property
 Identifies if the rebar shape has crank at end. Setting this property to true, will set the HookAngleAtEnd to 0 and EndTreatmentTypeIdAtEnd to ElementId.InvalidElementId.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasCrankAtEnd { get; set; }
Public Property HasCrankAtEnd As Boolean
	Get
	Set
public:
property bool HasCrankAtEnd {
	bool get ();
	void set (bool value);
}
member HasCrankAtEnd : bool with get, set
Property Value
Boolean
See Also
Reference
RebarShapeTerminationsData Class
Autodesk.Revit.DB.Structure Namespace